app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R') ORDER BY release_date ASC
---
  def index



    #parametro commit marca que se ha clicado en el boton de filtro
    if params[:commit]
      #valores seleccionados en el combo
      @ratings = params[:ratings]
      session[:ratings] = @ratings
      @movies =Movie.where(:rating =>  @ratings.keys )

SELECT "movies".* FROM "movies" ORDER BY release_date ASC
---
         @srating=session[:ratings]
         @movies=Movie.where(:rating =>  @srating.keys ).order("#{@sorting} ASC")
        else
          @movies = Movie.order("#{@sorting} ASC")